Documents/Обеспечительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Обеспечительства</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФиксированиеПогашенийОбеспечительством</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектОбеспечительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбеспечительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПредметаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСтоимостиПредметаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияОбеспечительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоПрекращенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПрекращенияОбеспечительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПрекращенияОбеспечительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбеспечения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакНаличияФраншизы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогашеноОсновноеОбязательство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозмещениеПринципалом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПредметаСтрахования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтоимостиПредметаЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсехОбеспеченныхДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВсехОбеспеченныхДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКАТОМестаНахожденияЗалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктуальнаяСтоимостьПредметаЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаАктуальнойСтоимостиПредметаЗалога</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Поручительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Поручительства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДолговоеОбязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поручитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страхование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийныйДепозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеОбеспечение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Обеспечительства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидОбеспеченияПриИзменении(Элемент)
	СброситьДанные();
	ПроверитьАктуальность();
	УправлениеВидимостьюКлиент();
КонецПроцедуры   

&НаСервере
Функция ВидОбеспечительстваПоручительство()
	Возврат Перечисления.ВидыОбеспечения.Поручительство; 
КонецФункции   

&НаСервере
Функция ВидОбеспечительстваЗалог()
	Возврат Перечисления.ВидыОбеспечения.Залог; 
КонецФункции  

 &НаСервере
Функция ВидОбеспечительстваСтрахование()
	Возврат Перечисления.ВидыОбеспечения.Страхование; 
КонецФункции   

 &НаСервере
Процедура СброситьДанные()
	Объект.Поручитель = "";
	Объект.ПризнакНаличияФраншизы = Ложь;
	Объект.ПредметЗалога = "";
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИзСпискаПоручителейНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поручительства.Поручитель КАК Поручитель
		|ИЗ
		|	РегистрСведений.Поручительства КАК Поручительства
		|ГДЕ
		|	Поручительства.ДолговоеОбязательство = &ДолговоеОбязательство";
	
	Запрос.УстановитьПараметр("ДолговоеОбязательство", Объект.ОбъектОбеспечительства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Поручитель = ВыборкаДетальныеЗаписи.Поручитель;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзСпискаПоручителей(Команда)
	ЗаполнитьИзСпискаПоручителейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВСписокПоручителейНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Поручитель) И ЗначениеЗаполнено(Объект.ОбъектОбеспечительства) Тогда 
		МЗ = РегистрыСведений.Поручительства.СоздатьМенеджерЗаписи();
		МЗ.ДолговоеОбязательство = Объект.ОбъектОбеспечительства;
		МЗ.Поручитель = Объект.Поручитель;
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСписокПоручителей(Команда)
	ДобавитьВСписокПоручителейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
КонецПроцедуры   

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	Если Объект.ВидОбеспечения = ВидОбеспечительстваПоручительство() Тогда
		Элементы.ГруппаПоручитель.Видимость = Истина;
	Иначе
		Элементы.ГруппаПоручитель.Видимость = Ложь;
	КонецЕсли;  
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваСтрахование() Тогда
		Элементы.ПризнакНаличияФраншизы.Видимость = Истина;
		
	Иначе
		Элементы.ПризнакНаличияФраншизы.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваЗалог() Тогда
		Элементы.ГруппаЗалог.Видимость = Истина;   
	Иначе
		Элементы.ГруппаЗалог.Видимость = Ложь;
	КонецЕсли;   
	
КонецПроцедуры  


&НаКлиенте
Процедура ПроверитьАктуальность()
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваСтрахование() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = ЭтаФорма.Элементы.ВалютаСтоимостиПредметаДоговора;
		Сообщение.Текст = "Поля Валюта и Стоимость предмета договора для Страхования неактуальны при использовании Единого формата отчета в БКИ";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Объект.ВидОбеспечения = ВидОбеспечительстваЗалог() Тогда 
		Если Не ЗначениеЗаполнено(Объект.КодОКАТОМестаНахожденияЗалога) ИЛИ Не ЗначениеЗаполнено(Объект.АктуальнаяСтоимостьПредметаЗалога) ИЛИ ЗначениеЗаполнено(Объект.ДатаРасчетаАктуальнойСтоимостиПредметаЗалога) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Поле = "Объект.КодОКАТОМестаНахожденияЗалога";
			Сообщение.Текст = "Поля Код ОКАТО, Акутальная  стоимость и дата расчета актуальной стоимости необходимы при использовании Единого формата отчета в БКИ";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
